# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.
#

mes = int(input('Введите месяц в виде целого числа от 1 до 12: '))
while mes > 12 or mes < 1:
    print("От 1 до 12 !")
    mes = int(input('Введите месяц в виде целого числа от 1 до 12: '))

list_zim = [1, 2, 12]
list_ves = [3, 4, 5]
list_let = [6, 7, 8]
list_ose = [9, 10, 11]

print("через list :")
if list_zim.count(mes) > 0:
    print("Зима")
elif list_ves.count(mes) > 0:
    print("Весна")
elif list_let.count(mes) > 0:
    print("Лето")
elif list_ose.count(mes) > 0:
    print("Осень")

print("через dict:")
dic = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

print(dic.get(mes))